Revit 2027 API
IndependentTag.GetLeaderElbow Method
 Returns the position of the elbow of the tag's leader that points to specified reference. Position of leader's elbow.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetLeaderElbow(
	Reference referenceTagged
)
Public Function GetLeaderElbow (
	referenceTagged As Reference
) As XYZ
public:
XYZ^ GetLeaderElbow(
	Reference^ referenceTagged
)
member GetLeaderElbow :
        referenceTagged : Reference -> XYZ
Parameters
referenceTagged Reference
 The reference which is tagged.
Return Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  The specified reference does not have a leader or its leader is straight. -or- The specified reference is not currently tagged.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior.
Remarks
 Straight leaders do not have elbow points.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace